public class self_homework12 {
    public static void main(String[] args){
        // 理解idea的项目结构
        /*
        * 1.project(项目)--首先整个微信可以看成是一个项目，项目是最大的
        *
        * 2.module(模块)--微信的下面有四大功能键“微信，通讯录，发现，我”是相互独立的可以看成模块
        * 所以，一个完整的项目，包含一个或是多个模块
        *
        * 3.package(包)--以微信的聊天消息模块为例，我们会用到很多的，文字，图片，视频，其他等东西，
        * 这些东西都是由代码来编写的，我们会在模块下面新建很多的包，将相同的东西放到同一个包里，例如
        * 将文字放到文字的包里，将图片放到图片的包里。右键src->新建包->多级包之间用.来隔开，例如com.itheima
        *
        * 4.class(类)在这里面写代码*/
    }
}
