public class self_homework36 {
    public static void main(String[] args){
        // 练习 逢7过
        /*
        * 朋友聚会时可能会玩一个游戏：逢7过
        * 游戏规则：从任意一个数字开始报数，当你要报的数字是包含7或者是7的倍数时
        * 都要说：过
        * 需求：使用程序在控制台打印出1-100之间的满足逢7必过规则的数据。*/

        // 获取1-100之间的每一个数字
        for (int i = 1;i <= 100;i++){
            // 判断如果是个位包含7，十位包含7，7的倍数的话就过
            if (i % 10 == 7 || i / 10 % 10 == 7 || i % 7 == 0){
                System.out.println("过");
                continue;
            }
            System.out.println(i);

            // i % 10 == 7  个位包含7
            // i / 10 % 10 == 7  十位包含7
            // i % 7 == 0  7的倍数

        }
    }
}
