public class self_homework116 {
    public static void main(String[] args){
        /*
        * 给定两个以字符串形式表示的非负数num1和num2，返回num1和num2的乘积，
        * 它们的乘积也表示为字符串形式。
        * 注意：需要用已有的知识完成*/

        // 不需要考虑乘积过大之后的结果
        // 就认为乘积一定是小于int的最大值的

        String num1 = "123456789";
        String num2 = "12345";

        // 1.把num1和num2变成对应的整数才可以
        // "123456789" -- > 123456789
        // "12345" -- > 12345
        // 先遍历字符串依次得到每一个字符 ‘1’，‘2’，‘3’，‘4’，...
        // 再把字符变成对应的数字即可 1,2,3,4,5...
        // 把每一个数字组合到一起 123456789

        // 2.利用整数进行相乘

        // 3.可以把整数变成字符串
        // +""
    }
}
